<!--NAVIGATION-->
<[目录](Index.ipynb) | [Pandas对象简介](03.01-Introducing-Pandas-Objects.ipynb) >

<a href="https://colab.research.google.com/github/wangyingsm/Python-Data-Science-Handbook/blob/master/notebooks/03.00-Introduction-to-Pandas.ipynb"><img align="left" src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open in Colab" title="Open and Execute in Google Colaboratory"></a>

## Selecting Subsets of Data from DataFrames with `loc`
## 使用 `loc` 從 DataFrames 中選擇數據子集

>In this chapter, we use the `loc` indexer to select subsets of data from DataFrames. The `loc` indexer selects data in a different manner than *just the brackets*. It has its own separate set of rules that we must learn.  使用 `loc` 索引器從 DataFrame 中選擇數據子集。

In [1]:
import pandas as pd
ps = pd.Series(['Ganga', 'Yamuna', 'Gomti', 'Koshi','Godavari','Kaveri'], index = ['a','b','c','d','e','f'])
ps

a       Ganga
b      Yamuna
c       Gomti
d       Koshi
e    Godavari
f      Kaveri
dtype: object

In [13]:
for i in ps: print(i)
for i in ps.iteritems():print(i)

Ganga
Yamuna
Gomti
Koshi
Godavari
Kaveri
('a', 'Ganga')
('b', 'Yamuna')
('c', 'Gomti')
('d', 'Koshi')
('e', 'Godavari')
('f', 'Kaveri')

In [15]:
ps.loc['d']
ps.loc['c':'f']
ps.loc['a':'f':2]  # a c e

a       Ganga
c       Gomti
e    Godavari
dtype: object

## `loc` with slice notation

Review Python's slice notation, which is used to select subsets from some core Python objects such as lists, tuples, and strings. Slice notation always has three components - the **start**, **stop**, and **step**. Syntactically, each component is separated by a colon like this - `start:stop:step`. All components of slice notation are optional and not necessary to include. Each has a default value if not included in the notation. The start component defaults to the beginning, the stop defaults to the end, and the step size to 1.

回顧一下 Python 的切片表示法，它用於從一些核心 Python 對象（如列表、元組和字符串）中選擇子集。 切片表示法始終具有三個組件 - **start**、**stop** 和 **step**。 從語法上講，每個組件都用冒號分隔，就像這樣 - `start:stop:step`。 切片符號的所有組件都是可選的，不需要包含。 如果未包含在符號中，則每個都有一個默認值。 start 組件默認為開頭，stop 默認為結尾，步長為 1。

In [34]:
import pandas as pd
df = pd.read_csv('input/sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [46]:
df.loc['Niko']
df.loc['Niko', :]
df.loc['Niko', 'state']

'TX'

In [50]:
df.loc[['Niko']]
df.loc[['Niko'], :]
df.loc[['Niko'], ['state']]

         state  color   food  age  height  score
name
Penelope    AL  white  Apple    4      80    3.3
Cornelia    TX    red  Beans   69     150    2.2

In [53]:
df.loc[['Dean', 'Aaron']]
df.loc[['Dean', 'Aaron'], 'food']
df.loc[['Dean', 'Aaron'], ['age', 'state', 'score']]

       age state  score
name
Dean    32    AK    1.8
Aaron   12    FL    9.0

In [54]:
df.loc['Niko':'Dean']
df.loc['Niko':'Dean':2]
df.loc['Niko':'Dean', ['state', 'color']]

         state  color   food  age  height  score
name
Niko        TX  green   Lamb    2      70    8.3
Penelope    AL  white  Apple    4      80    3.3

In [37]:
df.loc[:, 'height']
df.loc[:'Dean', 'height':]
df.loc[['Penelope','Cornelia'], :]

         state  color
name
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

## Summary of the `loc` indexer

* Primarily uses labels
* Selects rows and columns simultaneously with `df.loc[rows, cols]`
* Both row and column selections can be a:
    * single label
    * list of labels
    * slice of labels
    * boolean Series
* A comma separates row and column selections

In [56]:
import pandas as pd
bikes = pd.read_csv('input/bikes.csv')
bikes.head()
#bikes.tail()

,gender,starttime,stoptime,tripduration,from_station_name,start_capacity,to_station_name,end_capacity,temperature,wind_speed,events
0,Male,6/28/2013 19:01,6/28/2013 19:17,993,Lake Shore Dr & Monroe St,11,Michigan Ave & Oak St,15,73.9,12.7,mostlycloudy
1,Male,6/28/2013 22:53,6/28/2013 23:03,623,Clinton St & Washington Blvd,31,Wells St & Walton St,19,69.1,6.9,partlycloudy
2,Male,6/30/2013 14:43,6/30/2013 15:01,1040,Sheffield Ave & Kingsbury St,15,Dearborn St & Monroe St,23,73.0,16.1,mostlycloudy
3,Male,7/1/2013 10:05,7/1/2013 10:16,667,Carpenter St & Huron St,19,Clark St & Randolph St,31,72.0,16.1,mostlycloudy
4,Male,7/1/2013 11:16,7/1/2013 11:18,130,Damen Ave & Pierce Ave,19,Damen Ave & Pierce Ave,19,73.0,17.3,partlycloudy

## Changing display options

pandas gives you the ability to change how the output on your screen is displayed. For instance, the default number of columns displayed for a DataFrame is 20, meaning that if your DataFrame has more than 20 columns, then only the first and last 10 columns will be shown on the screen. All the other columns will be hidden and unable to be displayed. This is problematic as many DataFrames have more than 20 columns.

### Get current option value with `get_option`

There are a few dozen display options you can control to change the visual representation of your DataFrame. It is not necessary to remember the option names as the official documentation provides descriptions for all [available options][1]. 

Let's first learn how to retrieve each option value with the `get_option` function. This is not a DataFrame method, but instead, a function that is accessed directly from `pd`.  Below are three of the most common options to change.

[1]: https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html

### Use the `set_option` function to change an option value

To change an option's value, use the `set_option` function. You can set as many options as you would like at one time. It's usage is a bit strange. Pass it the option name as a string and follow it immediately with the value you want to set it to. Continue this pattern of option name followed by new value to set as many options as you desire. Below, we set the maximum number of columns to 100 and the maximum number of rows to 4.

In [57]:
pd.get_option('display.max_columns')
pd.get_option('display.max_rows')
pd.get_option('display.max_colwidth')
pd.set_option('display.max_columns', 100, 'display.max_rows', 4)

50

# Selecting Subsets of Data from DataFrames with `iloc`

The `iloc` indexer is very similar to the `loc` indexer but only uses **integer location** to make its subset selections. The word `iloc` itself stands for integer location and can help remind you what it does.

## Simultaneous row and column subset selection

The `iloc` indexer is capable of making simultaneous row and column selections just like `loc`. Selection with `iloc` takes the following form, with a comma separating the row and column selections.

```python
df.iloc[rows, cols]
```

Let's read in some sample data and then begin making selections with integer location using `iloc`.

### What is integer location?

Integer location is the term used to reference a row or column. The first row/column is referenced by the integer 0. Each subsequent row is referenced by the next integer. The last row/column is referenced by `n - 1` where `n` is the number of row/columns.

### Select using a list for both rows and columns

Let's select rows with integer location 2 and 4 along with the first and last columns. It is possible to use negative integers in the same manner as Python lists. The integer location -1 refers to the last column below.

In [33]:
import pandas as pd
df = pd.read_csv('input/sample_data.csv', index_col=0)
df

          state  color   food  age  height  score
name
Jane         NY   blue  Steak   30     165    4.6
Niko         TX  green   Lamb    2      70    8.3
...         ...    ...    ...  ...     ...    ...
Christina    TX  black  Melon   33     172    9.5
Cornelia     TX    red  Beans   69     150    2.2

[7 rows x 6 columns]

In [71]:
df.iloc[5]
df.iloc[2:]
df.iloc[::2]
df.iloc[3, 2]

'Apple'

In [68]:
df.iloc[[3], [2]]
df.iloc[[2, 3, 5], 4]
df.iloc[[2, 3, 5], [4]]
df.iloc[[2, 4], [0, -1]]

      state  score
name
Aaron    FL    9.0
Dean     AK    1.8

In [69]:
df.iloc[2, :]
df.iloc[:, [2, 4]]
df.iloc[2:4, [4, 2]]

          height   food
name
Aaron        120  Mango
Penelope      80  Apple

In [70]:
df.iloc[[2], :]
df.iloc[[5, 2, 4], 3:]
df.iloc[[-3, -1, -2], :]

          state  color    food  age  height  score
name
Dean         AK   gray  Cheese   32     180    1.8
Cornelia     TX    red   Beans   69     150    2.2
Christina    TX  black   Melon   33     172    9.5

## Summary of `iloc`

The `iloc` indexer is analogous to `loc` but only uses **integer location** for selection. The official pandas documentation refers to it as selection by **position**.

* Uses only integer location
* Selects rows and columns simultaneously with `df.iloc[rows, cols]`
* Selection can be a 
    * single integer
    * a list of integers
    * a slice of integers
* A comma separates row and column selections

## Exercises

Read in the movie dataset by executing the cell below and use it for the following exercises.

In [2]:
import pandas as pd
test_dict = {'Corey':[63,75,88], 'Kevin':[48,98,92], 'Akshay': [87, 86, 85]}
df = pd.DataFrame(test_dict)
df

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85

You can inspect the DataFrame. First, each dictionary key is listed as a column. Second, the rows are labeled with indices starting with 0 by default. Third, the visual layout is clear and legible.
Each column and row of DataFrame is officially represented as a Series. A series is a one-dimensional  array. Note that an array can be represented both by Series and numpy array, however they are two distinct data types and are interchangeable.

In [3]:
df = df.T                                    # Transpose DataFrame
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3']  # Rename Columns
df

        Quiz_1  Quiz_2  Quiz_3
Corey       63      75      88
Kevin       48      98      92
Akshay      87      86      85

In [50]:
df.iloc[0]   
df.iloc[0,:]
df.iloc[0:2, 1:3]
df.iloc[[0,1], [1,2]]

Quiz_1    63
Quiz_2    75
Quiz_3    88
Name: Corey, dtype: int64

In [5]:
# Access first column by name
df.Quiz_1
df.Quiz_4.astype(float)

df['Quiz_1']

Corey     63
Kevin     48
Akshay    87
Name: Quiz_1, dtype: int64

In [7]:
df.loc[['Corey', 'Kevin'], ['Quiz_2', 'Quiz_3']]

       Quiz_2  Quiz_3
Corey      75      88
Kevin      98      92

In [13]:
# Define new column as mean of other columns
df['Quiz_4'] = [92, 95, 88]
df['Quiz_Avg1'] = df.mean(axis=1)
df['Quiz_Avg2'] = df.mean(axis=1, skipna=True)
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg  Quiz_4  Quiz_Avg1  Quiz_Avg2
Corey       63      75      88  78.666667      92  79.333333  79.333333
Kevin       48      98      92  82.466667      95  83.093333  83.093333
Akshay      87      86      85  86.400000      88  86.480000  86.480000

Concatenating and Finding the Mean with Null Values for Our testscore Data

In [61]:
import numpy as np
# Create new DataFrame of one row
df_new = pd.DataFrame({'Quiz_1':[np.NaN], 
                       'Quiz_2':[np.NaN], 
                       'Quiz_3': [np.NaN],
                       'Quiz_4':[71]}, index=['Adrian'])
df_new

In [68]:
# Let Now, concatenate Dataframe with the added new row, Adrian, and display the new Dataframe value using df:
df = pd.concat([df, df_new])
df

,Formatted Date,Summary,Precip Type,Temperature (C),Apparent Temperature (C),Humidity,Wind Speed (km/h),Wind Bearing (degrees),Visibility (km),Loud Cover,Pressure (millibars),Daily Summary,Quiz_1,Quiz_2,Quiz_3,Quiz_4
0,2006-04-01 00:00:00.000 +0200,Partly Cloudy,rain,9.472222,7.388889,0.89,14.1197,251.0,15.8263,0.0,1015.13,Partly cloudy throughout the day.,NaN,NaN,NaN,NaN
1,2006-04-01 01:00:00.000 +0200,Partly Cloudy,rain,9.355556,7.227778,0.86,14.2646,259.0,15.8263,0.0,1015.63,Partly cloudy throughout the day.,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5998,2006-05-15 23:00:00.000 +0200,Clear,rain,12.927778,12.927778,0.90,2.7531,191.0,14.9569,0.0,1021.64,Partly cloudy until night.,NaN,NaN,NaN,NaN
Adrian,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,71.0